In [1]:
my_dict = {'name': ["a","b","c","d","e","f","g"],
           'age': [20,27,35,55,18,21,35],
           'designation':["VP","CEO","CFO","VP","VP","CEO","MD"]}

In [4]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(my_dict)

In [4]:
df

  name  age designation
0    a   20          VP
1    b   27         CEO
2    c   35         CFO
3    d   55          VP
4    e   18          VP
5    f   21         CEO
6    g   35          MD

In [34]:
df.to_csv('csv_example', sep=":", index=False)

In [42]:
df_csv = pd.read_csv('csv_example', sep=":", nrows=3)

In [43]:
df_csv

  name  age designation
0    a   20          VP
1    b   27         CEO
2    c   35         CFO

In [5]:
series = pd.Series(np.random.randn(1000))

In [6]:
series[::2] = np.nan

In [7]:
series.describe()

count    500.000000
mean      -0.029826
std        0.946893
min       -2.890715
25%       -0.660550
50%       -0.034729
75%        0.557376
max        2.977261
dtype: float64

In [9]:
frame = pd.DataFrame(np.random.randn(1000,5),columns=['a','b','c','d','e'])

In [10]:
frame.iloc[::2] = np.nan

In [11]:
frame.describe()

                a           b           c           d           e
count  500.000000  500.000000  500.000000  500.000000  500.000000
mean    -0.048035    0.049204   -0.054612   -0.012062    0.013701
std      1.019483    1.029111    1.003523    1.027772    0.978341
min     -3.261707   -4.023251   -3.511591   -3.285397   -2.895876
25%     -0.709741   -0.636120   -0.721347   -0.669930   -0.666234
50%     -0.062037    0.069018   -0.050529   -0.042312    0.045208
75%      0.594033    0.765238    0.606537    0.633148    0.672655
max      2.750607    2.810227    3.432817    3.338733    2.788831

In [12]:
s = pd.Series(['a','a','b','b','a','a',np.nan,'c','d','a'])

In [13]:
s.describe()

count     9
unique    4
top       a
freq      5
dtype: object

In [14]:
s1 = pd.Series(np.random.randn(5))

In [15]:
s1

0   -0.766141
1   -0.123588
2    0.399318
3    0.960946
4   -0.244720
dtype: float64

In [16]:
s1.idxmin(), s1.idxmax()

(0, 3)

In [17]:
df1 = pd.DataFrame(np.random.randn(5,3), columns=['A','B','C'])

In [18]:
df1

          A         B         C
0  0.532429  1.182399 -0.586939
1  1.951902 -0.426002  0.048299
2  1.535778  0.573116  0.289002
3  1.425088  0.210229  0.158108
4  0.333779  0.658654  0.565918

In [19]:
df1.idxmin(axis=0)

A    4
B    1
C    0
dtype: int64

In [20]:
df1.idxmax(axis=1)

0    B
1    A
2    A
3    A
4    B
dtype: object

In [23]:
df = pd.DataFrame({'a':[1,2,3], 'b':['a','b','c']})
df

   a  b
0  1  a
1  2  b
2  3  c

In [24]:
for label, ser in df.items():
    print(label)
    print(ser)

a
0    1
1    2
2    3
Name: a, dtype: int64
b
0    a
1    b
2    c
Name: b, dtype: object

In [25]:
for row_index, row in df.iterrows():
    print(row_index, row, sep='\n')

0
a    1
b    a
Name: 0, dtype: object
1
a    2
b    b
Name: 1, dtype: object
2
a    3
b    c
Name: 2, dtype: object

In [26]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, a=1, b='a')
Pandas(Index=1, a=2, b='b')
Pandas(Index=2, a=3, b='c')

# Object Creation

In [27]:
s = pd.Series([1,3,5,np.nan,6,8])

In [28]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [29]:
dates = pd.date_range('20130101', periods=6)

In [30]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [73]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [74]:
df

                   A         B         C         D
2013-01-01  0.743265 -0.078425  0.679767  0.573373
2013-01-02 -0.253751  0.520372  2.147644  0.137482
2013-01-03 -1.585899 -0.978866 -0.721107 -0.939083
2013-01-04  0.216467  0.135657  0.253000 -0.168962
2013-01-05 -0.324135 -0.467647 -0.120169  0.338216
2013-01-06  0.518865 -0.578314 -0.056076 -0.105473

In [33]:
df2 = pd.DataFrame({'A': 1.0,
                       'B': pd.Timestamp('20130102'),
                       'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                       'D': np.array([3] * 4, dtype='int32'),
                       'E': pd.Categorical(["test", "train", "test", "train"]),
                       'F': 'foo'})

In [34]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [36]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [37]:
df2.abs

<bound method NDFrame.abs of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [38]:
df.abs

<bound method NDFrame.abs of                    A         B         C         D
2013-01-01 -0.215711  0.266060 -0.463172 -0.975346
2013-01-02  0.150069  0.397614 -1.023434  0.278398
2013-01-03 -0.323462  0.893664  1.197657 -0.881820
2013-01-04  1.155628 -1.072181 -0.368218  1.002374
2013-01-05 -0.791432 -0.700743  1.424165 -0.816981
2013-01-06  0.331268  1.485375 -0.029995 -0.895544>

In [39]:
df.bool

<bound method NDFrame.bool of                    A         B         C         D
2013-01-01 -0.215711  0.266060 -0.463172 -0.975346
2013-01-02  0.150069  0.397614 -1.023434  0.278398
2013-01-03 -0.323462  0.893664  1.197657 -0.881820
2013-01-04  1.155628 -1.072181 -0.368218  1.002374
2013-01-05 -0.791432 -0.700743  1.424165 -0.816981
2013-01-06  0.331268  1.485375 -0.029995 -0.895544>

In [40]:
df.head()

                   A         B         C         D
2013-01-01 -0.215711  0.266060 -0.463172 -0.975346
2013-01-02  0.150069  0.397614 -1.023434  0.278398
2013-01-03 -0.323462  0.893664  1.197657 -0.881820
2013-01-04  1.155628 -1.072181 -0.368218  1.002374
2013-01-05 -0.791432 -0.700743  1.424165 -0.816981

In [41]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.155628 -1.072181 -0.368218  1.002374
2013-01-05 -0.791432 -0.700743  1.424165 -0.816981
2013-01-06  0.331268  1.485375 -0.029995 -0.895544

In [42]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [43]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [44]:
df.to_numpy()

array([[-0.21571118,  0.26606001, -0.46317224, -0.97534613],
       [ 0.15006913,  0.39761376, -1.0234342 ,  0.27839775],
       [-0.32346195,  0.89366415,  1.19765697, -0.88181988],
       [ 1.15562827, -1.07218114, -0.36821845,  1.00237398],
       [-0.79143168, -0.70074305,  1.42416478, -0.81698073],
       [ 0.33126794,  1.48537527, -0.02999539, -0.89554371]])

In [45]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.051060  0.211631  0.122834 -0.381486
std    0.667775  0.959765  0.976783  0.825522
min   -0.791432 -1.072181 -1.023434 -0.975346
25%   -0.296524 -0.459042 -0.439434 -0.892113
50%   -0.032821  0.331837 -0.199107 -0.849400
75%    0.285968  0.769652  0.890744  0.004553
max    1.155628  1.485375  1.424165  1.002374

In [46]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.215711    0.150069   -0.323462    1.155628   -0.791432    0.331268
B    0.266060    0.397614    0.893664   -1.072181   -0.700743    1.485375
C   -0.463172   -1.023434    1.197657   -0.368218    1.424165   -0.029995
D   -0.975346    0.278398   -0.881820    1.002374   -0.816981   -0.895544

In [47]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01 -0.975346 -0.463172  0.266060 -0.215711
2013-01-02  0.278398 -1.023434  0.397614  0.150069
2013-01-03 -0.881820  1.197657  0.893664 -0.323462
2013-01-04  1.002374 -0.368218 -1.072181  1.155628
2013-01-05 -0.816981  1.424165 -0.700743 -0.791432
2013-01-06 -0.895544 -0.029995  1.485375  0.331268

In [48]:
df.sort_values('B')

                   A         B         C         D
2013-01-04  1.155628 -1.072181 -0.368218  1.002374
2013-01-05 -0.791432 -0.700743  1.424165 -0.816981
2013-01-01 -0.215711  0.266060 -0.463172 -0.975346
2013-01-02  0.150069  0.397614 -1.023434  0.278398
2013-01-03 -0.323462  0.893664  1.197657 -0.881820
2013-01-06  0.331268  1.485375 -0.029995 -0.895544

In [49]:
df['A']

2013-01-01   -0.215711
2013-01-02    0.150069
2013-01-03   -0.323462
2013-01-04    1.155628
2013-01-05   -0.791432
2013-01-06    0.331268
Freq: D, Name: A, dtype: float64

In [50]:
df.loc['2013-01-04']

A    1.155628
B   -1.072181
C   -0.368218
D    1.002374
Name: 2013-01-04 00:00:00, dtype: float64

In [51]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.215711  0.266060 -0.463172 -0.975346
2013-01-02  0.150069  0.397614 -1.023434  0.278398
2013-01-03 -0.323462  0.893664  1.197657 -0.881820

In [52]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.150069  0.397614 -1.023434  0.278398
2013-01-03 -0.323462  0.893664  1.197657 -0.881820
2013-01-04  1.155628 -1.072181 -0.368218  1.002374

In [55]:
df.loc['2013-01-04']

A    1.155628
B   -1.072181
C   -0.368218
D    1.002374
Name: 2013-01-04 00:00:00, dtype: float64

In [56]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.215711  0.266060
2013-01-02  0.150069  0.397614
2013-01-03 -0.323462  0.893664
2013-01-04  1.155628 -1.072181
2013-01-05 -0.791432 -0.700743
2013-01-06  0.331268  1.485375

In [57]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.150069  0.397614
2013-01-03 -0.323462  0.893664
2013-01-04  1.155628 -1.072181

In [58]:
df.loc['20130102',['A','B']]

A    0.150069
B    0.397614
Name: 2013-01-02 00:00:00, dtype: float64

In [59]:
df.loc[dates[0],'A']

-0.2157111812227294

In [60]:
df.iloc[3]

A    1.155628
B   -1.072181
C   -0.368218
D    1.002374
Name: 2013-01-04 00:00:00, dtype: float64

In [61]:
df

                   A         B         C         D
2013-01-01 -0.215711  0.266060 -0.463172 -0.975346
2013-01-02  0.150069  0.397614 -1.023434  0.278398
2013-01-03 -0.323462  0.893664  1.197657 -0.881820
2013-01-04  1.155628 -1.072181 -0.368218  1.002374
2013-01-05 -0.791432 -0.700743  1.424165 -0.816981
2013-01-06  0.331268  1.485375 -0.029995 -0.895544

In [62]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  1.155628 -1.072181
2013-01-05 -0.791432 -0.700743

In [63]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.150069  0.397614 -1.023434  0.278398
2013-01-03 -0.323462  0.893664  1.197657 -0.881820

In [64]:
df = pd.DataFrame({'string': list('abc'),
                       'int64': list(range(1, 4)),
                       'uint8': np.arange(3, 6).astype('u1'),
                       'float64': np.arange(4.0, 7.0),
                       'bool1': [True, False, True],
                       'bool2': [False, True, False],
                       'dates': pd.date_range('now', periods=3),
                       'category': pd.Series(list("ABC")).astype('category')})

In [65]:
df.select_dtypes(include=[bool])

   bool1  bool2
0   True  False
1  False   True
2   True  False

In [67]:
df.select_dtypes(include=['int64'])

   int64
0      1
1      2
2      3

In [69]:
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,1,3,4.0,True,False,2022-09-27 12:55:31.689180,A
1,b,2,4,5.0,False,True,2022-09-28 12:55:31.689180,B
2,c,3,5,6.0,True,False,2022-09-29 12:55:31.689180,C

In [71]:
df[df['int64'] > 2]

,string,int64,uint8,float64,bool1,bool2,dates,category
2,c,3,5,6.0,True,False,2022-09-29 12:55:31.689180,C

In [72]:
df[df['string']>='b']

,string,int64,uint8,float64,bool1,bool2,dates,category
1,b,2,4,5.0,False,True,2022-09-28 12:55:31.689180,B
2,c,3,5,6.0,True,False,2022-09-29 12:55:31.689180,C

In [75]:
df

                   A         B         C         D
2013-01-01  0.743265 -0.078425  0.679767  0.573373
2013-01-02 -0.253751  0.520372  2.147644  0.137482
2013-01-03 -1.585899 -0.978866 -0.721107 -0.939083
2013-01-04  0.216467  0.135657  0.253000 -0.168962
2013-01-05 -0.324135 -0.467647 -0.120169  0.338216
2013-01-06  0.518865 -0.578314 -0.056076 -0.105473

In [76]:
df2 = df.copy()

In [78]:
df2['E'] = ['one','two','three','four','five','six']

In [79]:
df2

                   A         B         C         D      E
2013-01-01  0.743265 -0.078425  0.679767  0.573373    one
2013-01-02 -0.253751  0.520372  2.147644  0.137482    two
2013-01-03 -1.585899 -0.978866 -0.721107 -0.939083  three
2013-01-04  0.216467  0.135657  0.253000 -0.168962   four
2013-01-05 -0.324135 -0.467647 -0.120169  0.338216   five
2013-01-06  0.518865 -0.578314 -0.056076 -0.105473    six

In [80]:
df2[df2['E'].isin(['one','two'])]

                   A         B         C         D    E
2013-01-01  0.743265 -0.078425  0.679767  0.573373  one
2013-01-02 -0.253751  0.520372  2.147644  0.137482  two

In [82]:
df.iat[0,1] = -1

In [83]:
df

                   A         B         C         D
2013-01-01  0.743265 -1.000000  0.679767  0.573373
2013-01-02 -0.253751  0.520372  2.147644  0.137482
2013-01-03 -1.585899 -0.978866 -0.721107 -0.939083
2013-01-04  0.216467  0.135657  0.253000 -0.168962
2013-01-05 -0.324135 -0.467647 -0.120169  0.338216
2013-01-06  0.518865 -0.578314 -0.056076 -0.105473

In [84]:
df.iloc[0,1] = 2

In [85]:
df

                   A         B         C         D
2013-01-01  0.743265  2.000000  0.679767  0.573373
2013-01-02 -0.253751  0.520372  2.147644  0.137482
2013-01-03 -1.585899 -0.978866 -0.721107 -0.939083
2013-01-04  0.216467  0.135657  0.253000 -0.168962
2013-01-05 -0.324135 -0.467647 -0.120169  0.338216
2013-01-06  0.518865 -0.578314 -0.056076 -0.105473

In [86]:
df.at[0,'B']=-10

In [87]:
df

                            A          B         C         D
2013-01-01 00:00:00  0.743265   2.000000  0.679767  0.573373
2013-01-02 00:00:00 -0.253751   0.520372  2.147644  0.137482
2013-01-03 00:00:00 -1.585899  -0.978866 -0.721107 -0.939083
2013-01-04 00:00:00  0.216467   0.135657  0.253000 -0.168962
2013-01-05 00:00:00 -0.324135  -0.467647 -0.120169  0.338216
2013-01-06 00:00:00  0.518865  -0.578314 -0.056076 -0.105473
0                         NaN -10.000000       NaN       NaN

In [88]:
df.loc[0,'B']=-20

In [89]:
df

                            A          B         C         D
2013-01-01 00:00:00  0.743265   2.000000  0.679767  0.573373
2013-01-02 00:00:00 -0.253751   0.520372  2.147644  0.137482
2013-01-03 00:00:00 -1.585899  -0.978866 -0.721107 -0.939083
2013-01-04 00:00:00  0.216467   0.135657  0.253000 -0.168962
2013-01-05 00:00:00 -0.324135  -0.467647 -0.120169  0.338216
2013-01-06 00:00:00  0.518865  -0.578314 -0.056076 -0.105473
0                         NaN -20.000000       NaN       NaN

In [90]:
df.loc[:,'C'] = np.array([50]*len(df))

C:\Users\User\AppData\Local\Temp\ipykernel_21972\2089721736.py:1: FutureWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  df.loc[:,'C'] = np.array([50]*len(df))

In [91]:
df

                            A          B   C         D
2013-01-01 00:00:00  0.743265   2.000000  50  0.573373
2013-01-02 00:00:00 -0.253751   0.520372  50  0.137482
2013-01-03 00:00:00 -1.585899  -0.978866  50 -0.939083
2013-01-04 00:00:00  0.216467   0.135657  50 -0.168962
2013-01-05 00:00:00 -0.324135  -0.467647  50  0.338216
2013-01-06 00:00:00  0.518865  -0.578314  50 -0.105473
0                         NaN -20.000000  50       NaN

# Merge

In [92]:
df = pd.DataFrame(np.random.randn(10,4))

In [93]:
df

          0         1         2         3
0  0.706018 -0.523752  1.423901 -0.689911
1  2.035549 -1.039870 -0.597996  0.990255
2  0.065392 -0.094238 -0.247968  0.654612
3 -0.287299  0.425028 -0.469686 -0.441935
4 -0.155755  1.523916  1.434633 -0.754701
5  0.964154  0.735183  1.266893 -0.628759
6 -0.245855 -0.104009  0.782770  0.168370
7 -0.502176 -1.389550  0.301202 -1.459437
8 -0.427771 -0.690093 -0.239454 -0.018421
9 -0.766771 -1.006506  1.620451  0.842863

In [97]:
pieces = [df[:3], df[3:7], df[7:]]

In [98]:
pieces

[          0         1         2         3
 0  0.706018 -0.523752  1.423901 -0.689911
 1  2.035549 -1.039870 -0.597996  0.990255
 2  0.065392 -0.094238 -0.247968  0.654612,
           0         1         2         3
 3 -0.287299  0.425028 -0.469686 -0.441935
 4 -0.155755  1.523916  1.434633 -0.754701
 5  0.964154  0.735183  1.266893 -0.628759
 6 -0.245855 -0.104009  0.782770  0.168370,
           0         1         2         3
 7 -0.502176 -1.389550  0.301202 -1.459437
 8 -0.427771 -0.690093 -0.239454 -0.018421
 9 -0.766771 -1.006506  1.620451  0.842863]

In [99]:
pd.concat(pieces)

          0         1         2         3
0  0.706018 -0.523752  1.423901 -0.689911
1  2.035549 -1.039870 -0.597996  0.990255
2  0.065392 -0.094238 -0.247968  0.654612
3 -0.287299  0.425028 -0.469686 -0.441935
4 -0.155755  1.523916  1.434633 -0.754701
5  0.964154  0.735183  1.266893 -0.628759
6 -0.245855 -0.104009  0.782770  0.168370
7 -0.502176 -1.389550  0.301202 -1.459437
8 -0.427771 -0.690093 -0.239454 -0.018421
9 -0.766771 -1.006506  1.620451  0.842863

In [102]:
left = pd.DataFrame({'key':['foo','bar'],'lval':[1,2]})
left

   key  lval
0  foo     1
1  bar     2

In [103]:
right = pd.DataFrame({'key':['foo','bar'],'rval':[4,5]})

In [104]:
right

   key  rval
0  foo     4
1  bar     5

In [105]:
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [106]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                             'foo', 'bar', 'foo', 'foo'],
                        'B': ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                       'C': np.random.randn(8),
                       'D': np.random.randn(8)})

In [107]:
df

     A      B         C         D
0  foo    one -0.569637 -0.754618
1  bar    one -0.314451  0.323834
2  foo    two  0.046195  1.621550
3  bar  three -0.491725 -0.968919
4  foo    two -0.136537 -1.080000
5  bar    two -0.730827  1.507106
6  foo    one  0.216044 -0.695130
7  foo  three  1.027987 -1.687512

In [110]:
df.groupby('A').sum(numeric_only=True)

            C         D
A
bar -1.537002  0.862021
foo  0.584053 -2.595709

In [111]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.314451  0.323834
    three -0.491725 -0.968919
    two   -0.730827  1.507106
foo one   -0.353593 -1.449748
    three  1.027987 -1.687512
    two   -0.090341  0.541550

In [113]:
df.groupby('A').agg({'C':np.sum,'D':np.max})

            C         D
A
bar -1.537002  1.507106
foo  0.584053  1.621550

# Stack

In [114]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                         'foo', 'foo', 'qux', 'qux'],
                        ['one', 'two', 'one', 'two',
                         'one', 'two', 'one', 'two']]))

In [116]:
index = pd.MultiIndex.from_tuples(tuples, names=['first','second'])

In [117]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [118]:
df2 = df[:4]

In [119]:
df2

                     A         B
first second
bar   one    -0.605575 -0.581361
      two    -1.157927 -0.472507
baz   one     0.017979  1.394988
      two     0.482888 -0.894516

In [120]:
stacked = df2.stack()

In [121]:
stacked

first  second
bar    one     A   -0.605575
               B   -0.581361
       two     A   -1.157927
               B   -0.472507
baz    one     A    0.017979
               B    1.394988
       two     A    0.482888
               B   -0.894516
dtype: float64

In [122]:
stacked.dtype

dtype('float64')

In [123]:
stacked.unstack()

                     A         B
first second
bar   one    -0.605575 -0.581361
      two    -1.157927 -0.472507
baz   one     0.017979  1.394988
      two     0.482888 -0.894516

In [124]:
stacked.unstack(1)

second        one       two
first
bar   A -0.605575 -1.157927
      B -0.581361 -0.472507
baz   A  0.017979  0.482888
      B  1.394988 -0.894516

In [125]:
stacked.unstack(0)

first          bar       baz
second
one    A -0.605575  0.017979
       B -0.581361  1.394988
two    A -1.157927  0.482888
       B -0.472507 -0.894516

In [126]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                       'B': ['A', 'B', 'C'] * 4,
                       'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                       'D': np.random.randn(12),
                       'E': np.random.randn(12)})

In [128]:
df

        A  B    C         D         E
0     one  A  foo -0.334957  0.277315
1     one  B  foo -0.188915 -1.081930
2     two  C  foo -0.441897 -0.927949
3   three  A  bar -0.349202  0.303575
4     one  B  bar  1.038041  0.581940
5     one  C  bar -0.458923 -0.206600
6     two  A  foo  1.374309 -0.052080
7   three  B  foo  1.161391  0.816943
8     one  C  foo  0.455237  0.441213
9     one  A  bar  0.119756 -0.004092
10    two  B  bar  0.210633  2.328711
11  three  C  bar -1.843145  1.211605

In [127]:
pd.pivot_table(df, values='D',index=['A','B'],columns=['C'])

C             bar       foo
A     B
one   A  0.119756 -0.334957
      B  1.038041 -0.188915
      C -0.458923  0.455237
three A -0.349202       NaN
      B       NaN  1.161391
      C -1.843145       NaN
two   A       NaN  1.374309
      B  0.210633       NaN
      C       NaN -0.441897

# Pandas Apply Functions

In [129]:
def extract_city_name(df):
   .....:     """
   .....:     Chicago, IL -> Chicago for city_name column
   .....:     """
   .....:     df['city_name'] = df['city_and_code'].str.split(",").str.get(0)
   .....:     return df

In [130]:
def add_country_name(df, country_name=None):
   .....:     """
   .....:     Chicago -> Chicago-US for city_name column
   .....:     """
   .....:     col = 'city_name'
   .....:     df['city_and_country'] = df[col] + country_name
   .....:     return df

In [131]:
df_p = pd.DataFrame({'city_and_code': ['Chicago, IL']})

In [132]:
df_p

  city_and_code
0   Chicago, IL

In [133]:
add_country_name(extract_city_name(df_p), country_name='US')

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

In [136]:
(df_p.pipe(extract_city_name).pipe(add_country_name, country_name="US"))

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

In [139]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})
df

        one       two     three
a  0.646709  0.033887       NaN
b -0.709027  0.391035  0.426962
c -2.253844  0.275180  0.594139
d       NaN -0.136835  0.539944

In [138]:
df.apply(np.mean)

one     -0.089494
two      1.204134
three    0.949932
dtype: float64

In [140]:
df.apply(np.mean, axis=1)

a    0.340298
b    0.036323
c   -0.461509
d    0.201554
dtype: float64

In [141]:
df.apply(lambda x: x.max() - x.min())

one      2.900554
two      0.527870
three    0.167177
dtype: float64

In [143]:
df.apply(np.cumsum, axis=1)

        one       two     three
a  0.646709  0.680597       NaN
b -0.709027 -0.317992  0.108970
c -2.253844 -1.978665 -1.384526
d       NaN -0.136835  0.403109

In [144]:
df.apply(np.exp)

        one       two     three
a  1.909248  1.034468       NaN
b  0.492123  1.478511  1.532594
c  0.104995  1.316767  1.811470
d       NaN  0.872114  1.715910

In [145]:
def own_function(x):
    return x*x

In [146]:
df.apply(own_function)

        one       two     three
a  0.418233  0.001148       NaN
b  0.502720  0.152909  0.182296
c  5.079814  0.075724  0.353001
d       NaN  0.018724  0.291539

In [148]:
def subtract_and_divide(x, sub, divide = 1):
    return (x-sub) / divide

In [149]:
df.apply(subtract_and_divide, args=(5,3))

        one       two     three
a -1.451097 -1.655371       NaN
b -1.903009 -1.536322 -1.524346
c -2.417948 -1.574940 -1.468620
d       NaN -1.712278 -1.486685